      *HEADER,CLBRY,ALTL1                                                             
000100*    THIS TEXT MUST BE PLACED IN THE LIBRARY WHOSE NAME IS        ALTL14.2
000200*    EQUATED TO THE X-48 (XXXXX048) CARD.                         ALTL14.2
000300     PERFORM FAIL.                                                ALTL14.2
000400     SUBTRACT 1 FROM ERROR-COUNTER.                               ALTL14.2
000500     MOVE "TEXT COPIED FROM WRONG LIBRARY" TO RE-MARK.            ALTL14.2
      *END-OF,ALTL1                                                                   
