      *HEADER,CLBRY,ALTLB                                                             
000100*    THIS TEXT MUST BE PLACED IN THE LIBRARY WHOSE NAME IS        ALTLB4.2
000200*    EQUATED TO THE X-47 (XXXXX047) CARD.                         ALTLB4.2
000300     MOVE SPACES TO RE-MARK.                                      ALTLB4.2
000400     PERFORM PASS.                                                ALTLB4.2
000500     SUBTRACT 1 FROM ERROR-COUNTER.                               ALTLB4.2
      *END-OF,ALTLB                                                                   
