      *HEADER,CLBRY,K101A                                                             
000100             .                                                    K101A4.2
000200     02 TST-FLD-1 PICTURE 9(5).                                   K101A4.2
000300     02 FILLER    PICTURE X(115).                                 K101A4.2
      *END-OF,K101A                                                                   
