      *HEADER,CLBRY,K1PRA                                                             
000100     MOVE PROC-1 TO PROC-2.                                       K1PRA4.2
      *END-OF,K1PRA                                                                   
