      *HEADER,CLBRY,K1PRB                                                             
000100     MOVE WSTR4C TO WSTR91.                                       K1PRB4.2
000200     MOVE WSTR4B TO WSTR93.                                       K1PRB4.2
000300     MOVE WSTR4A TO WSTR92.                                       K1PRB4.2
      *END-OF,K1PRB                                                                   
