      *HEADER,CLBRY,K1SEA                                                             
000100 SECT-COPY-1.                                                     K1SEA4.2
000200     MOVE     95427 TO COPYSECT-1.                                K1SEA4.2
000300 SECT-COPY-2.                                                     K1SEA4.2
000400     MOVE     23121 TO COPYSECT-2.                                K1SEA4.2
000500 SECT-COPY-3.                                                     K1SEA4.2
000600     MOVE     "LIBCO" TO COPYSECT-3.                              K1SEA4.2
000700 SECT-COPY-4.                                                     K1SEA4.2
000800     MOVE     "PYTST" TO COPYSECT-4.                              K1SEA4.2
      *END-OF,K1SEA                                                                   
