      *HEADER,CLBRY,K1W04                                                             
000100 01  GRP-001.                                                     K1W044.2
000200     02 WRK-DS-05V00 PIC S9(5)                                    K1W044.2
000300              VALUE                                               K1W044.2
000400                   IS                                             K1W044.2
000500                            ZERO.                                 K1W044.2
      *END-OF,K1W04                                                                   
