      *HEADER,CLBRY,K1W03                                                             
000100     RCD-7 PIC 9(5)                                               K1W034.2
      *END-OF,K1W03                                                                   
