      *HEADER,CLBRY,K1W01                                                             
000100             PICTURE 9(5) VALUE 97523.                            K1W014.2
000200 77  RCD-2    PICTURE 9(5) VALUE 23497.                           K1W014.2
      *END-OF,K1W01                                                                   
