      *HEADER,CLBRY,K1W02                                                             
000100     RCD-4    PIC 9(5) VALUE 02734.                               K1W024.2
000200 77  RCD-5    PICTURE IS 99999 VALUE IS                           K1W024.2
      *END-OF,K1W02                                                                   
