      *HEADER,CLBRY,K1WKC                                                             
000100 01 Z-E-R-O-E-S PICTURE 9(2) VALUE ZEROES.                        K1WKC4.2
000200 01 O-N-E       PICTURE 9(2) VALUE 01.                            K1WKC4.2
      *END-OF,K1WKC                                                                   
