      *HEADER,CLBRY,K1WKB                                                             
000100     02 WSTR4A  PICTURE XXX VALUE "ABC".                          K1WKB4.2
000200     02 WSTR4B  PICTURE XXX VALUE "DEF".                          K1WKB4.2
000300     02 WSTR4C  PICTURE XXX VALUE "GHI".                          K1WKB4.2
      *END-OF,K1WKB                                                                   
