      *HEADER,CLBRY,K1WKY                                                             
000100     02 WSTR-2A PICTURE XXX VALUE                               "AK1WKY4.2
000200-    "BC".                                                        K1WKY4.2
      *END-OF,K1WKY                                                                   
