      *HEADER,CLBRY,K3FCB                                                             
000100     SELECT PRINT-FILE ASSIGN TO                                  K3FCB4.2
000200     XXXXX055.                                                    K3FCB4.2
000300     SELECT DUMMY-TEST-FILE ASSIGN TO                             K3FCB4.2
000400     XXXXP002.                                                    K3FCB4.2
      *END-OF,K3FCB                                                                   
