      *HEADER,CLBRY,K501A                                                             
000100     02  KEYS-GROUP.                                              K501A4.2
000200         03  KEY-1 PICTURE 9.                                     K501A4.2
000300         03  KEY-2 PICTURE 99.                                    K501A4.2
000400         03  KEY-3 PICTURE 999.                                   K501A4.2
000500         03  KEY-4 PICTURE 9999.                                  K501A4.2
000600         03  KEY-5 PICTURE 99999.                                 K501A4.2
000700     02 RDF-KEYS REDEFINES KEYS-GROUP PICTURE 9(15).              K501A4.2
000800     02 FILLER PICTURE X(105).                                    K501A4.2
      *END-OF,K501A                                                                   
