      *HEADER,CLBRY,K7SEA                                                             
000100 COPY-TEST-1.                                                     K7SEA4.2
000200     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
000300     MOVE     "COPY-TEST-1  " TO PAR-NAME.                        K7SEA4.2
000400     PERFORM  PASS.                                               K7SEA4.2
000500     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
000600     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
000700     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
000800     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
000900 COPY-TEST-2.                                                     K7SEA4.2
001000     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
001100     MOVE     "COPY-TEST-2  " TO PAR-NAME.                        K7SEA4.2
001200     PERFORM  PASS.                                               K7SEA4.2
001300     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
001400     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
001500     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
001600     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
001700 COPY-TEST-3.                                                     K7SEA4.2
001800     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
001900     MOVE     "COPY-TEST-3  " TO PAR-NAME.                        K7SEA4.2
002000     PERFORM  PASS.                                               K7SEA4.2
002100     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
002200     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
002300     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
002400     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
002500 COPY-TEST-4.                                                     K7SEA4.2
002600     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
002700     MOVE     "COPY-TEST-4  " TO PAR-NAME.                        K7SEA4.2
002800     PERFORM  PASS.                                               K7SEA4.2
002900     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
003000     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
003100     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
003200     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
003300 COPY-TEST-5.                                                     K7SEA4.2
003400     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
003500     MOVE     "COPY-TEST-5  " TO PAR-NAME.                        K7SEA4.2
003600     PERFORM  PASS.                                               K7SEA4.2
003700     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
003800     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
003900     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
004000     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
004100 COPY-TEST-6.                                                     K7SEA4.2
004200     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
004300     MOVE     "COPY-TEST-6  " TO PAR-NAME.                        K7SEA4.2
004400     PERFORM  PASS.                                               K7SEA4.2
004500     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
004600     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
004700     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
004800     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
004900 COPY-TEST-7.                                                     K7SEA4.2
005000     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
005100     MOVE     "COPY-TEST-7  " TO PAR-NAME.                        K7SEA4.2
005200     PERFORM  PASS.                                               K7SEA4.2
005300     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
005400     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
005500     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
005600     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
005700 COPY-TEST-8.                                                     K7SEA4.2
005800     MOVE     "COPY-TEST-8  " TO PAR-NAME.                        K7SEA4.2
005900     PERFORM  PASS.                                               K7SEA4.2
006000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
006100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
006200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
006300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
006400 COPY-TEST-9.                                                     K7SEA4.2
006500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
006600     MOVE     "COPY-TEST-9  " TO PAR-NAME.                        K7SEA4.2
006700     PERFORM  PASS.                                               K7SEA4.2
006800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
006900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
007000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
007100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
007200 COPY-TEST-10.                                                    K7SEA4.2
007300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
007400     MOVE     "COPY-TEST-10 " TO PAR-NAME.                        K7SEA4.2
007500     PERFORM  PASS.                                               K7SEA4.2
007600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
007700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
007800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
007900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
008000 COPY-TEST-11.                                                    K7SEA4.2
008100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
008200     MOVE     "COPY-TEST-11 " TO PAR-NAME.                        K7SEA4.2
008300     PERFORM  PASS.                                               K7SEA4.2
008400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
008500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
008600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
008700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
008800 COPY-TEST-12.                                                    K7SEA4.2
008900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
009000     MOVE     "COPY-TEST-12 " TO PAR-NAME.                        K7SEA4.2
009100     PERFORM  PASS.                                               K7SEA4.2
009200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
009300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
009400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
009500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
009600 COPY-TEST-13.                                                    K7SEA4.2
009700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
009800     MOVE     "COPY-TEST-13 " TO PAR-NAME.                        K7SEA4.2
009900     PERFORM  PASS.                                               K7SEA4.2
010000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
010100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
010200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
010300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
010400 COPY-TEST-14.                                                    K7SEA4.2
010500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
010600     MOVE     "COPY-TEST-14 " TO PAR-NAME.                        K7SEA4.2
010700     PERFORM  PASS.                                               K7SEA4.2
010800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
010900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
011000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
011100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
011200 COPY-TEST-15.                                                    K7SEA4.2
011300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
011400     MOVE     "COPY-TEST-15 " TO PAR-NAME.                        K7SEA4.2
011500     PERFORM  PASS.                                               K7SEA4.2
011600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
011700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
011800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
011900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
012000 COPY-TEST-16.                                                    K7SEA4.2
012100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
012200     MOVE     "COPY-TEST-16 " TO PAR-NAME.                        K7SEA4.2
012300     PERFORM  PASS.                                               K7SEA4.2
012400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
012500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
012600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
012700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
012800 COPY-TEST-17.                                                    K7SEA4.2
012900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
013000     MOVE     "COPY-TEST-17 " TO PAR-NAME.                        K7SEA4.2
013100     PERFORM  PASS.                                               K7SEA4.2
013200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
013300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
013400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
013500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
013600 COPY-TEST-18.                                                    K7SEA4.2
013700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
013800     MOVE     "COPY-TEST-18 " TO PAR-NAME.                        K7SEA4.2
013900     PERFORM  PASS.                                               K7SEA4.2
014000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
014100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
014200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
014300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
014400 COPY-TEST-19.                                                    K7SEA4.2
014500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
014600     MOVE     "COPY-TEST-19 " TO PAR-NAME.                        K7SEA4.2
014700     PERFORM  PASS.                                               K7SEA4.2
014800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
014900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
015000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
015100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
015200 COPY-TEST-20.                                                    K7SEA4.2
015300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
015400     MOVE     "COPY-TEST-20 " TO PAR-NAME.                        K7SEA4.2
015500     PERFORM  PASS.                                               K7SEA4.2
015600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
015700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
015800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
015900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
016000 COPY-TEST-21.                                                    K7SEA4.2
016100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
016200     MOVE     "COPY-TEST-21 " TO PAR-NAME.                        K7SEA4.2
016300     PERFORM  PASS.                                               K7SEA4.2
016400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
016500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
016600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
016700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
016800 COPY-TEST-2I.                                                    K7SEA4.2
016900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
017000     MOVE     "COPY-TEST-22 " TO PAR-NAME.                        K7SEA4.2
017100     PERFORM  PASS.                                               K7SEA4.2
017200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
017300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
017400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
017500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
017600 COPY-TEST-23.                                                    K7SEA4.2
017700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
017800     MOVE     "COPY-TEST-23 " TO PAR-NAME.                        K7SEA4.2
017900     PERFORM  PASS.                                               K7SEA4.2
018000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
018100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
018200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
018300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
018400 COPY-TEST-24.                                                    K7SEA4.2
018500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
018600     MOVE     "COPY-TEST-24 " TO PAR-NAME.                        K7SEA4.2
018700     PERFORM  PASS.                                               K7SEA4.2
018800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
018900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
019000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
019100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
019200 COPY-TEST-25.                                                    K7SEA4.2
019300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
019400     MOVE     "COPY-TEST-25 " TO PAR-NAME.                        K7SEA4.2
019500     PERFORM  PASS.                                               K7SEA4.2
019600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
019700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
019800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
019900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
020000 COPY-TEST-26.                                                    K7SEA4.2
020100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
020200     MOVE     "COPY-TEST-26 " TO PAR-NAME.                        K7SEA4.2
020300     PERFORM  PASS.                                               K7SEA4.2
020400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
020500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
020600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
020700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
020800 COPY-TEST-27.                                                    K7SEA4.2
020900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
021000     MOVE     "COPY-TEST-27 " TO PAR-NAME.                        K7SEA4.2
021100     PERFORM  PASS.                                               K7SEA4.2
021200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
021300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
021400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
021500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
021600 COPY-TEST-28.                                                    K7SEA4.2
021700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
021800     MOVE     "COPY-TEST-28 " TO PAR-NAME.                        K7SEA4.2
021900     PERFORM  PASS.                                               K7SEA4.2
022000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
022100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
022200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
022300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
022400 COPY-TEST-29.                                                    K7SEA4.2
022500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
022600     MOVE     "COPY-TEST-29 " TO PAR-NAME.                        K7SEA4.2
022700     PERFORM  PASS.                                               K7SEA4.2
022800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
022900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
023000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
023100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
023200 COPY-TEST-30.                                                    K7SEA4.2
023300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
023400     MOVE     "COPY-TEST-30 " TO PAR-NAME.                        K7SEA4.2
023500     PERFORM  PASS.                                               K7SEA4.2
023600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
023700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
023800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
023900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
024000 COPY-TEST-31.                                                    K7SEA4.2
024100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
024200     MOVE     "COPY-TEST-31 " TO PAR-NAME.                        K7SEA4.2
024300     PERFORM  PASS.                                               K7SEA4.2
024400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
024500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
024600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
024700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
024800 COPY-TEST-32.                                                    K7SEA4.2
024900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
025000     MOVE     "COPY-TEST-32 " TO PAR-NAME.                        K7SEA4.2
025100     PERFORM  PASS.                                               K7SEA4.2
025200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
025300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
025400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
025500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
025600 COPY-TEST-33.                                                    K7SEA4.2
025700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
025800     MOVE     "COPY-TEST-33 " TO PAR-NAME.                        K7SEA4.2
025900     PERFORM  PASS.                                               K7SEA4.2
026000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
026100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
026200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
026300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
026400 COPY-TEST-34.                                                    K7SEA4.2
026500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
026600     MOVE     "COPY-TEST-34 " TO PAR-NAME.                        K7SEA4.2
026700     PERFORM  PASS.                                               K7SEA4.2
026800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
026900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
027000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
027100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
027200 COPY-TEST-35.                                                    K7SEA4.2
027300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
027400     MOVE     "COPY-TEST-35 " TO PAR-NAME.                        K7SEA4.2
027500     PERFORM  PASS.                                               K7SEA4.2
027600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
027700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
027800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
027900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
028000 COPY-TEST-36.                                                    K7SEA4.2
028100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
028200     MOVE     "COPY-TEST-36 " TO PAR-NAME.                        K7SEA4.2
028300     PERFORM  PASS.                                               K7SEA4.2
028400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
028500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
028600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
028700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
028800 COPY-TEST-37.                                                    K7SEA4.2
028900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
029000     MOVE     "COPY-TEST-37 " TO PAR-NAME.                        K7SEA4.2
029100     PERFORM  PASS.                                               K7SEA4.2
029200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
029300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
029400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
029500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
029600 COPY-TEST-38.                                                    K7SEA4.2
029700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
029800     MOVE     "COPY-TEST-38 " TO PAR-NAME.                        K7SEA4.2
029900     PERFORM  PASS.                                               K7SEA4.2
030000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
030100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
030200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
030300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
030400 COPY-TEST-39.                                                    K7SEA4.2
030500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
030600     MOVE     "COPY-TEST-39 " TO PAR-NAME.                        K7SEA4.2
030700     PERFORM  PASS.                                               K7SEA4.2
030800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
030900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
031000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
031100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
031200 COPY-TEST-40.                                                    K7SEA4.2
031300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
031400     MOVE     "COPY-TEST-40 " TO PAR-NAME.                        K7SEA4.2
031500     PERFORM  PASS.                                               K7SEA4.2
031600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
031700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
031800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
031900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
032000 COPY-TEST-41.                                                    K7SEA4.2
032100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
032200     MOVE     "COPY-TEST-41 " TO PAR-NAME.                        K7SEA4.2
032300     PERFORM  PASS.                                               K7SEA4.2
032400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
032500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
032600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
032700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
032800 COPY-TEST-42.                                                    K7SEA4.2
032900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
033000     MOVE     "COPY-TEST-42 " TO PAR-NAME.                        K7SEA4.2
033100     PERFORM  PASS.                                               K7SEA4.2
033200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
033300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
033400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
033500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
033600 COPY-TEST-43.                                                    K7SEA4.2
033700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
033800     MOVE     "COPY-TEST-43 " TO PAR-NAME.                        K7SEA4.2
033900     PERFORM  PASS.                                               K7SEA4.2
034000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
034100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
034200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
034300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
034400 COPY-TEST-44.                                                    K7SEA4.2
034500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
034600     MOVE     "COPY-TEST-44 " TO PAR-NAME.                        K7SEA4.2
034700     PERFORM  PASS.                                               K7SEA4.2
034800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
034900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
035000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
035100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
035200 COPY-TEST-45.                                                    K7SEA4.2
035300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
035400     MOVE     "COPY-TEST-45 " TO PAR-NAME.                        K7SEA4.2
035500     PERFORM  PASS.                                               K7SEA4.2
035600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
035700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
035800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
035900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
036000 COPY-TEST-46.                                                    K7SEA4.2
036100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
036200     MOVE     "COPY-TEST-46 " TO PAR-NAME.                        K7SEA4.2
036300     PERFORM  PASS.                                               K7SEA4.2
036400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
036500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
036600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
036700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
036800 COPY-TEST-47.                                                    K7SEA4.2
036900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
037000     MOVE     "COPY-TEST-47 " TO PAR-NAME.                        K7SEA4.2
037100     PERFORM  PASS.                                               K7SEA4.2
037200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
037300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
037400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
037500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
037600 COPY-TEST-48.                                                    K7SEA4.2
037700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
037800     MOVE     "COPY-TEST-48 " TO PAR-NAME.                        K7SEA4.2
037900     PERFORM  PASS.                                               K7SEA4.2
038000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
038100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
038200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
038300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
038400 COPY-TEST-49.                                                    K7SEA4.2
038500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
038600     MOVE     "COPY-TEST-49 " TO PAR-NAME.                        K7SEA4.2
038700     PERFORM  PASS.                                               K7SEA4.2
038800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
038900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
039000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
039100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
039200 COPY-TEST-50.                                                    K7SEA4.2
039300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
039400     MOVE     "COPY-TEST-50 " TO PAR-NAME.                        K7SEA4.2
039500     PERFORM  PASS.                                               K7SEA4.2
039600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
039700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
039800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
039900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
040000 COPY-TEST-51.                                                    K7SEA4.2
040100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
040200     MOVE     "COPY-TEST-51 " TO PAR-NAME.                        K7SEA4.2
040300     PERFORM  PASS.                                               K7SEA4.2
040400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
040500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
040600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
040700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
040800 COPY-TEST-52.                                                    K7SEA4.2
040900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
041000     MOVE     "COPY-TEST-52 " TO PAR-NAME.                        K7SEA4.2
041100     PERFORM  PASS.                                               K7SEA4.2
041200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
041300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
041400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
041500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
041600 COPY-TEST-53.                                                    K7SEA4.2
041700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
041800     MOVE     "COPY-TEST-53 " TO PAR-NAME.                        K7SEA4.2
041900     PERFORM  PASS.                                               K7SEA4.2
042000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
042100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
042200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
042300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
042400 COPY-TEST-54.                                                    K7SEA4.2
042500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
042600     MOVE     "COPY-TEST-54 " TO PAR-NAME.                        K7SEA4.2
042700     PERFORM  PASS.                                               K7SEA4.2
042800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
042900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
043000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
043100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
043200 COPY-TEST-55.                                                    K7SEA4.2
043300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
043400     MOVE     "COPY-TEST-55 " TO PAR-NAME.                        K7SEA4.2
043500     PERFORM  PASS.                                               K7SEA4.2
043600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
043700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
043800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
043900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
044000 COPY-TEST-56.                                                    K7SEA4.2
044100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
044200     MOVE     "COPY-TEST-56 " TO PAR-NAME.                        K7SEA4.2
044300     PERFORM  PASS.                                               K7SEA4.2
044400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
044500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
044600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
044700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
044800 COPY-TEST-57.                                                    K7SEA4.2
044900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
045000     MOVE     "COPY-TEST-57 " TO PAR-NAME.                        K7SEA4.2
045100     PERFORM  PASS.                                               K7SEA4.2
045200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
045300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
045400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
045500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
045600 COPY-TEST-58.                                                    K7SEA4.2
045700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
045800     MOVE     "COPY-TEST-58 " TO PAR-NAME.                        K7SEA4.2
045900     PERFORM  PASS.                                               K7SEA4.2
046000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
046100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
046200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
046300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
046400 COPY-TEST-59.                                                    K7SEA4.2
046500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
046600     MOVE     "COPY-TEST-59 " TO PAR-NAME.                        K7SEA4.2
046700     PERFORM  PASS.                                               K7SEA4.2
046800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
046900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
047000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
047100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
047200 COPY-TEST-60.                                                    K7SEA4.2
047300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
047400     MOVE     "COPY-TEST-60 " TO PAR-NAME.                        K7SEA4.2
047500     PERFORM  PASS.                                               K7SEA4.2
047600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
047700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
047800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
047900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
048000 COPY-TEST-61.                                                    K7SEA4.2
048100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
048200     MOVE     "COPY-TEST-61 " TO PAR-NAME.                        K7SEA4.2
048300     PERFORM  PASS.                                               K7SEA4.2
048400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
048500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
048600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
048700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
048800 COPY-TEST-62.                                                    K7SEA4.2
048900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
049000     MOVE     "COPY-TEST-62 " TO PAR-NAME.                        K7SEA4.2
049100     PERFORM  PASS.                                               K7SEA4.2
049200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
049300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
049400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
049500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
049600 COPY-TEST-63.                                                    K7SEA4.2
049700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
049800     MOVE     "COPY-TEST-63 " TO PAR-NAME.                        K7SEA4.2
049900     PERFORM  PASS.                                               K7SEA4.2
050000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
050100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
050200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
050300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
050400 COPY-TEST-64.                                                    K7SEA4.2
050500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
050600     MOVE     "COPY-TEST-64 " TO PAR-NAME.                        K7SEA4.2
050700     PERFORM  PASS.                                               K7SEA4.2
050800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
050900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
051000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
051100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
051200 COPY-TEST-65.                                                    K7SEA4.2
051300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
051400     MOVE     "COPY-TEST-65 " TO PAR-NAME.                        K7SEA4.2
051500     PERFORM  PASS.                                               K7SEA4.2
051600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
051700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
051800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
051900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
052000 COPY-TEST-66.                                                    K7SEA4.2
052100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
052200     MOVE     "COPY-TEST-66 " TO PAR-NAME.                        K7SEA4.2
052300     PERFORM  PASS.                                               K7SEA4.2
052400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
052500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
052600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
052700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
052800 COPY-TEST-67.                                                    K7SEA4.2
052900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
053000     MOVE     "COPY-TEST-67 " TO PAR-NAME.                        K7SEA4.2
053100     PERFORM  PASS.                                               K7SEA4.2
053200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
053300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
053400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
053500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
053600 COPY-TEST-68.                                                    K7SEA4.2
053700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
053800     MOVE     "COPY-TEST-68 " TO PAR-NAME.                        K7SEA4.2
053900     PERFORM  PASS.                                               K7SEA4.2
054000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
054100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
054200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
054300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
054400 COPY-TEST-69.                                                    K7SEA4.2
054500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
054600     MOVE     "COPY-TEST-69 " TO PAR-NAME.                        K7SEA4.2
054700     PERFORM  PASS.                                               K7SEA4.2
054800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
054900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
055000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
055100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
055200 COPY-TEST-70.                                                    K7SEA4.2
055300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
055400     MOVE     "COPY-TEST-70 " TO PAR-NAME.                        K7SEA4.2
055500     PERFORM  PASS.                                               K7SEA4.2
055600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
055700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
055800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
055900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
056000 COPY-TEST-71.                                                    K7SEA4.2
056100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
056200     MOVE     "COPY-TEST-71 " TO PAR-NAME.                        K7SEA4.2
056300     PERFORM  PASS.                                               K7SEA4.2
056400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
056500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
056600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
056700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
056800 COPY-TEST-72.                                                    K7SEA4.2
056900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
057000     MOVE     "COPY-TEST-72 " TO PAR-NAME.                        K7SEA4.2
057100     PERFORM  PASS.                                               K7SEA4.2
057200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
057300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
057400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
057500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
057600 COPY-TEST-73.                                                    K7SEA4.2
057700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
057800     MOVE     "COPY-TEST-73 " TO PAR-NAME.                        K7SEA4.2
057900     PERFORM  PASS.                                               K7SEA4.2
058000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
058100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
058200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
058300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
058400 COPY-TEST-74.                                                    K7SEA4.2
058500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
058600     MOVE     "COPY-TEST-74 " TO PAR-NAME.                        K7SEA4.2
058700     PERFORM  PASS.                                               K7SEA4.2
058800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
058900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
059000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
059100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
059200 COPY-TEST-75.                                                    K7SEA4.2
059300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
059400     MOVE     "COPY-TEST-75 " TO PAR-NAME.                        K7SEA4.2
059500     PERFORM  PASS.                                               K7SEA4.2
059600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
059700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
059800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
059900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
060000 COPY-TEST-76.                                                    K7SEA4.2
060100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
060200     MOVE     "COPY-TEST-76 " TO PAR-NAME.                        K7SEA4.2
060300     PERFORM  PASS.                                               K7SEA4.2
060400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
060500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
060600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
060700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
060800 COPY-TEST-77.                                                    K7SEA4.2
060900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
061000     MOVE     "COPY-TEST-77 " TO PAR-NAME.                        K7SEA4.2
061100     PERFORM  PASS.                                               K7SEA4.2
061200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
061300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
061400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
061500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
061600 COPY-TEST-78.                                                    K7SEA4.2
061700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
061800     MOVE     "COPY-TEST-78 " TO PAR-NAME.                        K7SEA4.2
061900     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
062000     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
062100     PERFORM  PASS.                                               K7SEA4.2
062200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
062300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
062400 COPY-TEST-79.                                                    K7SEA4.2
062500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
062600     MOVE     "COPY-TEST-79 " TO PAR-NAME.                        K7SEA4.2
062700     PERFORM  PASS.                                               K7SEA4.2
062800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
062900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
063000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
063100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
063200 COPY-TEST-80.                                                    K7SEA4.2
063300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
063400     MOVE     "COPY-TEST-80 " TO PAR-NAME.                        K7SEA4.2
063500     PERFORM  PASS.                                               K7SEA4.2
063600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
063700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
063800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
063900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
064000 COPY-TEST-81.                                                    K7SEA4.2
064100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
064200     MOVE     "COPY-TEST-81 " TO PAR-NAME.                        K7SEA4.2
064300     PERFORM  PASS.                                               K7SEA4.2
064400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
064500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
064600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
064700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
064800 COPY-TEST-82.                                                    K7SEA4.2
064900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
065000     MOVE     "COPY-TEST-82 " TO PAR-NAME.                        K7SEA4.2
065100     PERFORM  PASS.                                               K7SEA4.2
065200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
065300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
065400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
065500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
065600 COPY-TEST-83.                                                    K7SEA4.2
065700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
065800     MOVE     "COPY-TEST-83 " TO PAR-NAME.                        K7SEA4.2
065900     PERFORM  PASS.                                               K7SEA4.2
066000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
066100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
066200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
066300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
066400 COPY-TEST-84.                                                    K7SEA4.2
066500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
066600     MOVE     "COPY-TEST-84 " TO PAR-NAME.                        K7SEA4.2
066700     PERFORM  PASS.                                               K7SEA4.2
066800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
066900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
067000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
067100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
067200 COPY-TEST-85.                                                    K7SEA4.2
067300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
067400     MOVE     "COPY-TEST-85 " TO PAR-NAME.                        K7SEA4.2
067500     PERFORM  PASS.                                               K7SEA4.2
067600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
067700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
067800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
067900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
068000 COPY-TEST-86.                                                    K7SEA4.2
068100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
068200     MOVE     "COPY-TEST-86 " TO PAR-NAME.                        K7SEA4.2
068300     PERFORM  PASS.                                               K7SEA4.2
068400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
068500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
068600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
068700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
068800 COPY-TEST-87.                                                    K7SEA4.2
068900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
069000     MOVE     "COPY-TEST-87 " TO PAR-NAME.                        K7SEA4.2
069100     PERFORM  PASS.                                               K7SEA4.2
069200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
069300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
069400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
069500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
069600 COPY-TEST-88.                                                    K7SEA4.2
069700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
069800     MOVE     "COPY-TEST-88 " TO PAR-NAME.                        K7SEA4.2
069900     PERFORM  PASS.                                               K7SEA4.2
070000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
070100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
070200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
070300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
070400 COPY-TEST-89.                                                    K7SEA4.2
070500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
070600     MOVE     "COPY-TEST-89 " TO PAR-NAME.                        K7SEA4.2
070700     PERFORM  PASS.                                               K7SEA4.2
070800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
070900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
071000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
071100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
071200 COPY-TEST-90.                                                    K7SEA4.2
071300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
071400     MOVE     "COPY-TEST-90 " TO PAR-NAME.                        K7SEA4.2
071500     PERFORM  PASS.                                               K7SEA4.2
071600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
071700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
071800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
071900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
072000 COPY-TEST-91.                                                    K7SEA4.2
072100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
072200     MOVE     "COPY-TEST-91 " TO PAR-NAME.                        K7SEA4.2
072300     PERFORM  PASS.                                               K7SEA4.2
072400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
072500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
072600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
072700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
072800 COPY-TEST-92.                                                    K7SEA4.2
072900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
073000     MOVE     "COPY-TEST-92 " TO PAR-NAME.                        K7SEA4.2
073100     PERFORM  PASS.                                               K7SEA4.2
073200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
073300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
073400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
073500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
073600 COPY-TEST-93.                                                    K7SEA4.2
073700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
073800     MOVE     "COPY-TEST-93 " TO PAR-NAME.                        K7SEA4.2
073900     PERFORM  PASS.                                               K7SEA4.2
074000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
074100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
074200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
074300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
074400 COPY-TEST-94.                                                    K7SEA4.2
074500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
074600     MOVE     "COPY-TEST-94 " TO PAR-NAME.                        K7SEA4.2
074700     PERFORM  PASS.                                               K7SEA4.2
074800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
074900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
075000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
075100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
075200 COPY-TEST-95.                                                    K7SEA4.2
075300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
075400     MOVE     "COPY-TEST-95 " TO PAR-NAME.                        K7SEA4.2
075500     PERFORM  PASS.                                               K7SEA4.2
075600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
075700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
075800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
075900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
076000 COPY-TEST-96.                                                    K7SEA4.2
076100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
076200     MOVE     "COPY-TEST-96 " TO PAR-NAME.                        K7SEA4.2
076300     PERFORM  PASS.                                               K7SEA4.2
076400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
076500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
076600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
076700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
076800 COPY-TEST-97.                                                    K7SEA4.2
076900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
077000     MOVE     "COPY-TEST-97 " TO PAR-NAME.                        K7SEA4.2
077100     PERFORM  PASS.                                               K7SEA4.2
077200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
077300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
077400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
077500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
077600 COPY-TEST-98.                                                    K7SEA4.2
077700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
077800     MOVE     "COPY-TEST-98 " TO PAR-NAME.                        K7SEA4.2
077900     PERFORM  PASS.                                               K7SEA4.2
078000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
078100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
078200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
078300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
078400 COPY-TEST-99.                                                    K7SEA4.2
078500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
078600     MOVE     "COPY-TEST-99 " TO PAR-NAME.                        K7SEA4.2
078700     PERFORM  PASS.                                               K7SEA4.2
078800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
078900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
079000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
079100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
079200 COPY-TEST-100.                                                   K7SEA4.2
079300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
079400     MOVE     "COPY-TEST-100" TO PAR-NAME.                        K7SEA4.2
079500     PERFORM  PASS.                                               K7SEA4.2
079600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
079700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
079800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
079900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
080000 COPY-TEST-101.                                                   K7SEA4.2
080100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
080200     MOVE     "COPY-TEST-101" TO PAR-NAME.                        K7SEA4.2
080300     PERFORM  PASS.                                               K7SEA4.2
080400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
080500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
080600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
080700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
080800 COPY-TEST-102.                                                   K7SEA4.2
080900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
081000     MOVE     "COPY-TEST-102" TO PAR-NAME.                        K7SEA4.2
081100     PERFORM  PASS.                                               K7SEA4.2
081200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
081300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
081400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
081500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
081600 COPY-TEST-103.                                                   K7SEA4.2
081700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
081800     MOVE     "COPY-TEST-103" TO PAR-NAME.                        K7SEA4.2
081900     PERFORM  PASS.                                               K7SEA4.2
082000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
082100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
082200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
082300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
082400 COPY-TEST-104.                                                   K7SEA4.2
082500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
082600     MOVE     "COPY-TEST-104" TO PAR-NAME.                        K7SEA4.2
082700     PERFORM  PASS.                                               K7SEA4.2
082800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
082900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
083000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
083100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
083200 COPY-TEST-105.                                                   K7SEA4.2
083300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
083400     MOVE     "COPY-TEST-105" TO PAR-NAME.                        K7SEA4.2
083500     PERFORM  PASS.                                               K7SEA4.2
083600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
083700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
083800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
083900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
084000 COPY-TEST-106.                                                   K7SEA4.2
084100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
084200     MOVE     "COPY-TEST-106" TO PAR-NAME.                        K7SEA4.2
084300     PERFORM  PASS.                                               K7SEA4.2
084400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
084500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
084600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
084700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
084800 COPY-TEST-107.                                                   K7SEA4.2
084900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
085000     MOVE     "COPY-TEST-107" TO PAR-NAME.                        K7SEA4.2
085100     PERFORM  PASS.                                               K7SEA4.2
085200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
085300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
085400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
085500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
085600 COPY-TEST-108.                                                   K7SEA4.2
085700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
085800     MOVE     "COPY-TEST-108" TO PAR-NAME.                        K7SEA4.2
085900     PERFORM  PASS.                                               K7SEA4.2
086000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
086100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
086200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
086300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
086400 COPY-TEST-109.                                                   K7SEA4.2
086500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
086600     MOVE     "COPY-TEST-109" TO PAR-NAME.                        K7SEA4.2
086700     PERFORM  PASS.                                               K7SEA4.2
086800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
086900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
087000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
087100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
087200 COPY-TEST-110.                                                   K7SEA4.2
087300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
087400     MOVE     "COPY-TEST-110" TO PAR-NAME.                        K7SEA4.2
087500     PERFORM  PASS.                                               K7SEA4.2
087600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
087700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
087800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
087900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
088000 COPY-TEST-111.                                                   K7SEA4.2
088100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
088200     MOVE     "COPY-TEST-111" TO PAR-NAME.                        K7SEA4.2
088300     PERFORM  PASS.                                               K7SEA4.2
088400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
088500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
088600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
088700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
088800 COPY-TEST-112.                                                   K7SEA4.2
088900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
089000     MOVE     "COPY-TEST-112" TO PAR-NAME.                        K7SEA4.2
089100     PERFORM  PASS.                                               K7SEA4.2
089200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
089300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
089400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
089500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
089600 COPY-TEST-113.                                                   K7SEA4.2
089700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
089800     MOVE     "COPY-TEST-113" TO PAR-NAME.                        K7SEA4.2
089900     PERFORM  PASS.                                               K7SEA4.2
090000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
090100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
090200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
090300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
090400 COPY-TEST-114.                                                   K7SEA4.2
090500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
090600     MOVE     "COPY-TEST-114" TO PAR-NAME.                        K7SEA4.2
090700     PERFORM  PASS.                                               K7SEA4.2
090800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
090900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
091000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
091100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
091200 COPY-TEST-115.                                                   K7SEA4.2
091300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
091400     MOVE     "COPY-TEST-115" TO PAR-NAME.                        K7SEA4.2
091500     PERFORM  PASS.                                               K7SEA4.2
091600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
091700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
091800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
091900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
092000 COPY-TEST-116.                                                   K7SEA4.2
092100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
092200     MOVE     "COPY-TEST-116" TO PAR-NAME.                        K7SEA4.2
092300     PERFORM  PASS.                                               K7SEA4.2
092400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
092500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
092600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
092700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
092800 COPY-TEST-117.                                                   K7SEA4.2
092900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
093000     MOVE     "COPY-TEST-117" TO PAR-NAME.                        K7SEA4.2
093100     PERFORM  PASS.                                               K7SEA4.2
093200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
093300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
093400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
093500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
093600 COPY-TEST-118.                                                   K7SEA4.2
093700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
093800     MOVE     "COPY-TEST-118" TO PAR-NAME.                        K7SEA4.2
093900     PERFORM  PASS.                                               K7SEA4.2
094000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
094100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
094200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
094300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
094400 COPY-TEST-119.                                                   K7SEA4.2
094500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
094600     MOVE     "COPY-TEST-119" TO PAR-NAME.                        K7SEA4.2
094700     PERFORM  PASS.                                               K7SEA4.2
094800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
094900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
095000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
095100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
095200 COPY-TEST-120.                                                   K7SEA4.2
095300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
095400     MOVE     "COPY-TEST-120" TO PAR-NAME.                        K7SEA4.2
095500     PERFORM  PASS.                                               K7SEA4.2
095600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
095700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
095800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
095900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
096000 COPY-TEST-121.                                                   K7SEA4.2
096100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
096200     MOVE     "COPY-TEST-121" TO PAR-NAME.                        K7SEA4.2
096300     PERFORM  PASS.                                               K7SEA4.2
096400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
096500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
096600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
096700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
096800 COPY-TEST-122.                                                   K7SEA4.2
096900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
097000     MOVE     "COPY-TEST-122" TO PAR-NAME.                        K7SEA4.2
097100     PERFORM  PASS.                                               K7SEA4.2
097200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
097300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
097400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
097500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
097600 COPY-TEST-123.                                                   K7SEA4.2
097700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
097800     MOVE     "COPY-TEST-123" TO PAR-NAME.                        K7SEA4.2
097900     PERFORM  PASS.                                               K7SEA4.2
098000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
098100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
098200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
098300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
098400 COPY-TEST-124.                                                   K7SEA4.2
098500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
098600     MOVE     "COPY-TEST-124" TO PAR-NAME.                        K7SEA4.2
098700     PERFORM  PASS.                                               K7SEA4.2
098800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
098900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
099000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
099100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
099200 COPY-TEST-125.                                                   K7SEA4.2
099300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
099400     MOVE     "COPY-TEST-125" TO PAR-NAME.                        K7SEA4.2
099500     PERFORM  PASS.                                               K7SEA4.2
099600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
099700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
099800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
099900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
100000 COPY-TEST-126.                                                   K7SEA4.2
100100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
100200     MOVE     "COPY-TEST-126" TO PAR-NAME.                        K7SEA4.2
100300     PERFORM  PASS.                                               K7SEA4.2
100400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
100500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
100600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
100700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
100800 COPY-TEST-127.                                                   K7SEA4.2
100900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
101000     MOVE     "COPY-TEST-127" TO PAR-NAME.                        K7SEA4.2
101100     PERFORM  PASS.                                               K7SEA4.2
101200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
101300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
101400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
101500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
101600 COPY-TEST-128.                                                   K7SEA4.2
101700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
101800     MOVE     "COPY-TEST-128" TO PAR-NAME.                        K7SEA4.2
101900     PERFORM  PASS.                                               K7SEA4.2
102000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
102100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
102200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
102300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
102400 COPY-TEST-129.                                                   K7SEA4.2
102500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
102600     MOVE     "COPY-TEST-129" TO PAR-NAME.                        K7SEA4.2
102700     PERFORM  PASS.                                               K7SEA4.2
102800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
102900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
103000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
103100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
103200 COPY-TEST-130.                                                   K7SEA4.2
103300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
103400     MOVE     "COPY-TEST-130" TO PAR-NAME.                        K7SEA4.2
103500     PERFORM  PASS.                                               K7SEA4.2
103600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
103700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
103800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
103900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
104000 COPY-TEST-131.                                                   K7SEA4.2
104100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
104200     MOVE     "COPY-TEST-131" TO PAR-NAME.                        K7SEA4.2
104300     PERFORM  PASS.                                               K7SEA4.2
104400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
104500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
104600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
104700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
104800 COPY-TEST-132.                                                   K7SEA4.2
104900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
105000     MOVE     "COPY-TEST-132" TO PAR-NAME.                        K7SEA4.2
105100     PERFORM  PASS.                                               K7SEA4.2
105200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
105300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
105400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
105500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
105600 COPY-TEST-133.                                                   K7SEA4.2
105700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
105800     MOVE     "COPY-TEST-133" TO PAR-NAME.                        K7SEA4.2
105900     PERFORM  PASS.                                               K7SEA4.2
106000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
106100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
106200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
106300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
106400 COPY-TEST-134.                                                   K7SEA4.2
106500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
106600     MOVE     "COPY-TEST-134" TO PAR-NAME.                        K7SEA4.2
106700     PERFORM  PASS.                                               K7SEA4.2
106800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
106900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
107000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
107100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
107200 COPY-TEST-135.                                                   K7SEA4.2
107300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
107400     MOVE     "COPY-TEST-135" TO PAR-NAME.                        K7SEA4.2
107500     PERFORM  PASS.                                               K7SEA4.2
107600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
107700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
107800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
107900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
108000 COPY-TEST-136.                                                   K7SEA4.2
108100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
108200     MOVE     "COPY-TEST-136" TO PAR-NAME.                        K7SEA4.2
108300     PERFORM  PASS.                                               K7SEA4.2
108400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
108500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
108600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
108700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
108800 COPY-TEST-137.                                                   K7SEA4.2
108900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
109000     MOVE     "COPY-TEST-137" TO PAR-NAME.                        K7SEA4.2
109100     PERFORM  PASS.                                               K7SEA4.2
109200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
109300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
109400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
109500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
109600 COPY-TEST-138.                                                   K7SEA4.2
109700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
109800     MOVE     "COPY-TEST-138" TO PAR-NAME.                        K7SEA4.2
109900     PERFORM  PASS.                                               K7SEA4.2
110000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
110100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
110200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
110300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
110400 COPY-TEST-139.                                                   K7SEA4.2
110500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
110600     MOVE     "COPY-TEST-139" TO PAR-NAME.                        K7SEA4.2
110700     PERFORM  PASS.                                               K7SEA4.2
110800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
110900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
111000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
111100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
111200 COPY-TEST-140.                                                   K7SEA4.2
111300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
111400     MOVE     "COPY-TEST-140" TO PAR-NAME.                        K7SEA4.2
111500     PERFORM  PASS.                                               K7SEA4.2
111600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
111700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
111800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
111900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
112000 COPY-TEST-141.                                                   K7SEA4.2
112100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
112200     MOVE     "COPY-TEST-141" TO PAR-NAME.                        K7SEA4.2
112300     PERFORM  PASS.                                               K7SEA4.2
112400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
112500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
112600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
112700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
112800 COPY-TEST-142.                                                   K7SEA4.2
112900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
113000     MOVE     "COPY-TEST-142" TO PAR-NAME.                        K7SEA4.2
113100     PERFORM  PASS.                                               K7SEA4.2
113200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
113300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
113400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
113500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
113600 COPY-TEST-143.                                                   K7SEA4.2
113700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
113800     MOVE     "COPY-TEST-143" TO PAR-NAME.                        K7SEA4.2
113900     PERFORM  PASS.                                               K7SEA4.2
114000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
114100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
114200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
114300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
114400 COPY-TEST-144.                                                   K7SEA4.2
114500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
114600     MOVE     "COPY-TEST-144" TO PAR-NAME.                        K7SEA4.2
114700     PERFORM  PASS.                                               K7SEA4.2
114800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
114900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
115000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
115100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
115200 COPY-TEST-145.                                                   K7SEA4.2
115300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
115400     MOVE     "COPY-TEST-145" TO PAR-NAME.                        K7SEA4.2
115500     PERFORM  PASS.                                               K7SEA4.2
115600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
115700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
115800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
115900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
116000 COPY-TEST-146.                                                   K7SEA4.2
116100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
116200     MOVE     "COPY-TEST-146" TO PAR-NAME.                        K7SEA4.2
116300     PERFORM  PASS.                                               K7SEA4.2
116400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
116500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
116600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
116700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
116800 COPY-TEST-147.                                                   K7SEA4.2
116900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
117000     MOVE     "COPY-TEST-147" TO PAR-NAME.                        K7SEA4.2
117100     PERFORM  PASS.                                               K7SEA4.2
117200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
117300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
117400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
117500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
117600 COPY-TEST-148.                                                   K7SEA4.2
117700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
117800     MOVE     "COPY-TEST-148" TO PAR-NAME.                        K7SEA4.2
117900     PERFORM  PASS.                                               K7SEA4.2
118000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
118100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
118200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
118300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
118400 COPY-TEST-149.                                                   K7SEA4.2
118500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
118600     MOVE     "COPY-TEST-149" TO PAR-NAME.                        K7SEA4.2
118700     PERFORM  PASS.                                               K7SEA4.2
118800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
118900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
119000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
119100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
119200 COPY-TEST-150.                                                   K7SEA4.2
119300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
119400     MOVE     "COPY-TEST-150" TO PAR-NAME.                        K7SEA4.2
119500     PERFORM  PASS.                                               K7SEA4.2
119600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
119700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
119800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
119900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
120000 COPY-TEST-151.                                                   K7SEA4.2
120100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
120200     MOVE     "COPY-TEST-151" TO PAR-NAME.                        K7SEA4.2
120300     PERFORM  PASS.                                               K7SEA4.2
120400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
120500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
120600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
120700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
120800 COPY-TEST-152.                                                   K7SEA4.2
120900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
121000     MOVE     "COPY-TEST-152" TO PAR-NAME.                        K7SEA4.2
121100     PERFORM  PASS.                                               K7SEA4.2
121200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
121300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
121400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
121500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
121600 COPY-TEST-153.                                                   K7SEA4.2
121700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
121800     MOVE     "COPY-TEST-153" TO PAR-NAME.                        K7SEA4.2
121900     PERFORM  PASS.                                               K7SEA4.2
122000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
122100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
122200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
122300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
122400 COPY-TEST-154.                                                   K7SEA4.2
122500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
122600     MOVE     "COPY-TEST-154" TO PAR-NAME.                        K7SEA4.2
122700     PERFORM  PASS.                                               K7SEA4.2
122800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
122900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
123000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
123100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
123200 COPY-TEST-155.                                                   K7SEA4.2
123300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
123400     MOVE     "COPY-TEST-155" TO PAR-NAME.                        K7SEA4.2
123500     PERFORM  PASS.                                               K7SEA4.2
123600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
123700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
123800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
123900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
124000 COPY-TEST-156.                                                   K7SEA4.2
124100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
124200     MOVE     "COPY-TEST-156" TO PAR-NAME.                        K7SEA4.2
124300     PERFORM  PASS.                                               K7SEA4.2
124400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
124500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
124600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
124700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
124800 COPY-TEST-157.                                                   K7SEA4.2
124900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
125000     MOVE     "COPY-TEST-157" TO PAR-NAME.                        K7SEA4.2
125100     PERFORM  PASS.                                               K7SEA4.2
125200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
125300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
125400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
125500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
125600 COPY-TEST-158.                                                   K7SEA4.2
125700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
125800     MOVE     "COPY-TEST-158" TO PAR-NAME.                        K7SEA4.2
125900     PERFORM  PASS.                                               K7SEA4.2
126000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
126100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
126200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
126300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
126400 COPY-TEST-159.                                                   K7SEA4.2
126500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
126600     MOVE     "COPY-TEST-159" TO PAR-NAME.                        K7SEA4.2
126700     PERFORM  PASS.                                               K7SEA4.2
126800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
126900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
127000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
127100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
127200 COPY-TEST-160.                                                   K7SEA4.2
127300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
127400     MOVE     "COPY-TEST-160" TO PAR-NAME.                        K7SEA4.2
127500     PERFORM  PASS.                                               K7SEA4.2
127600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
127700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
127800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
127900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
128000 COPY-TEST-161.                                                   K7SEA4.2
128100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
128200     MOVE     "COPY-TEST-161" TO PAR-NAME.                        K7SEA4.2
128300     PERFORM  PASS.                                               K7SEA4.2
128400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
128500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
128600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
128700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
128800 COPY-TEST-162.                                                   K7SEA4.2
128900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
129000     MOVE     "COPY-TEST-162" TO PAR-NAME.                        K7SEA4.2
129100     PERFORM  PASS.                                               K7SEA4.2
129200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
129300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
129400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
129500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
129600 COPY-TEST-163.                                                   K7SEA4.2
129700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
129800     MOVE     "COPY-TEST-163" TO PAR-NAME.                        K7SEA4.2
129900     PERFORM  PASS.                                               K7SEA4.2
130000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
130100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
130200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
130300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
130400 COPY-TEST-164.                                                   K7SEA4.2
130500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
130600     MOVE     "COPY-TEST-164" TO PAR-NAME.                        K7SEA4.2
130700     PERFORM  PASS.                                               K7SEA4.2
130800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
130900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
131000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
131100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
131200 COPY-TEST-165.                                                   K7SEA4.2
131300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
131400     MOVE     "COPY-TEST-165" TO PAR-NAME.                        K7SEA4.2
131500     PERFORM  PASS.                                               K7SEA4.2
131600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
131700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
131800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
131900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
132000 COPY-TEST-166.                                                   K7SEA4.2
132100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
132200     MOVE     "COPY-TEST-166" TO PAR-NAME.                        K7SEA4.2
132300     PERFORM  PASS.                                               K7SEA4.2
132400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
132500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
132600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
132700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
132800 COPY-TEST-167.                                                   K7SEA4.2
132900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
133000     MOVE     "COPY-TEST-167" TO PAR-NAME.                        K7SEA4.2
133100     PERFORM  PASS.                                               K7SEA4.2
133200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
133300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
133400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
133500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
133600 COPY-TEST-168.                                                   K7SEA4.2
133700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
133800     MOVE     "COPY-TEST-168" TO PAR-NAME.                        K7SEA4.2
133900     PERFORM  PASS.                                               K7SEA4.2
134000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
134100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
134200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
134300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
134400 COPY-TEST-169.                                                   K7SEA4.2
134500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
134600     MOVE     "COPY-TEST-169" TO PAR-NAME.                        K7SEA4.2
134700     PERFORM  PASS.                                               K7SEA4.2
134800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
134900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
135000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
135100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
135200 COPY-TEST-170.                                                   K7SEA4.2
135300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
135400     MOVE     "COPY-TEST-170" TO PAR-NAME.                        K7SEA4.2
135500     PERFORM  PASS.                                               K7SEA4.2
135600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
135700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
135800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
135900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
136000 COPY-TEST-171.                                                   K7SEA4.2
136100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
136200     MOVE     "COPY-TEST-171" TO PAR-NAME.                        K7SEA4.2
136300     PERFORM  PASS.                                               K7SEA4.2
136400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
136500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
136600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
136700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
136800 COPY-TEST-172.                                                   K7SEA4.2
136900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
137000     MOVE     "COPY-TEST-172" TO PAR-NAME.                        K7SEA4.2
137100     PERFORM  PASS.                                               K7SEA4.2
137200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
137300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
137400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
137500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
137600 COPY-TEST-173.                                                   K7SEA4.2
137700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
137800     MOVE     "COPY-TEST-173" TO PAR-NAME.                        K7SEA4.2
137900     PERFORM  PASS.                                               K7SEA4.2
138000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
138100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
138200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
138300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
138400 COPY-TEST-174.                                                   K7SEA4.2
138500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
138600     MOVE     "COPY-TEST-174" TO PAR-NAME.                        K7SEA4.2
138700     PERFORM  PASS.                                               K7SEA4.2
138800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
138900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
139000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
139100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
139200 COPY-TEST-175.                                                   K7SEA4.2
139300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
139400     MOVE     "COPY-TEST-175" TO PAR-NAME.                        K7SEA4.2
139500     PERFORM  PASS.                                               K7SEA4.2
139600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
139700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
139800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
139900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
140000 COPY-TEST-176.                                                   K7SEA4.2
140100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
140200     MOVE     "COPY-TEST-176" TO PAR-NAME.                        K7SEA4.2
140300     PERFORM  PASS.                                               K7SEA4.2
140400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
140500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
140600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
140700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
140800 COPY-TEST-177.                                                   K7SEA4.2
140900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
141000     MOVE     "COPY-TEST-177" TO PAR-NAME.                        K7SEA4.2
141100     PERFORM  PASS.                                               K7SEA4.2
141200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
141300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
141400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
141500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
141600 COPY-TEST-178.                                                   K7SEA4.2
141700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
141800     MOVE     "COPY-TEST-178" TO PAR-NAME.                        K7SEA4.2
141900     PERFORM  PASS.                                               K7SEA4.2
142000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
142100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
142200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
142300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
142400 COPY-TEST-179.                                                   K7SEA4.2
142500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
142600     MOVE     "COPY-TEST-179" TO PAR-NAME.                        K7SEA4.2
142700     PERFORM  PASS.                                               K7SEA4.2
142800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
142900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
143000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
143100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
143200 COPY-TEST-180.                                                   K7SEA4.2
143300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
143400     MOVE     "COPY-TEST-180" TO PAR-NAME.                        K7SEA4.2
143500     PERFORM  PASS.                                               K7SEA4.2
143600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
143700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
143800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
143900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
144000 COPY-TEST-181.                                                   K7SEA4.2
144100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
144200     MOVE     "COPY-TEST-181" TO PAR-NAME.                        K7SEA4.2
144300     PERFORM  PASS.                                               K7SEA4.2
144400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
144500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
144600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
144700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
144800 COPY-TEST-182.                                                   K7SEA4.2
144900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
145000     MOVE     "COPY-TEST-182" TO PAR-NAME.                        K7SEA4.2
145100     PERFORM  PASS.                                               K7SEA4.2
145200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
145300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
145400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
145500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
145600 COPY-TEST-183.                                                   K7SEA4.2
145700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
145800     MOVE     "COPY-TEST-183" TO PAR-NAME.                        K7SEA4.2
145900     PERFORM  PASS.                                               K7SEA4.2
146000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
146100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
146200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
146300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
146400 COPY-TEST-184.                                                   K7SEA4.2
146500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
146600     MOVE     "COPY-TEST-184" TO PAR-NAME.                        K7SEA4.2
146700     PERFORM  PASS.                                               K7SEA4.2
146800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
146900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
147000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
147100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
147200 COPY-TEST-185.                                                   K7SEA4.2
147300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
147400     MOVE     "COPY-TEST-185" TO PAR-NAME.                        K7SEA4.2
147500     PERFORM  PASS.                                               K7SEA4.2
147600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
147700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
147800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
147900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
148000 COPY-TEST-186.                                                   K7SEA4.2
148100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
148200     MOVE     "COPY-TEST-186" TO PAR-NAME.                        K7SEA4.2
148300     PERFORM  PASS.                                               K7SEA4.2
148400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
148500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
148600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
148700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
148800 COPY-TEST-187.                                                   K7SEA4.2
148900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
149000     MOVE     "COPY-TEST-187" TO PAR-NAME.                        K7SEA4.2
149100     PERFORM  PASS.                                               K7SEA4.2
149200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
149300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
149400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
149500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
149600 COPY-TEST-188.                                                   K7SEA4.2
149700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
149800     MOVE     "COPY-TEST-188" TO PAR-NAME.                        K7SEA4.2
149900     PERFORM  PASS.                                               K7SEA4.2
150000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
150100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
150200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
150300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
150400 COPY-TEST-189.                                                   K7SEA4.2
150500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
150600     MOVE     "COPY-TEST-189" TO PAR-NAME.                        K7SEA4.2
150700     PERFORM  PASS.                                               K7SEA4.2
150800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
150900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
151000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
151100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
151200 COPY-TEST-190.                                                   K7SEA4.2
151300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
151400     MOVE     "COPY-TEST-190" TO PAR-NAME.                        K7SEA4.2
151500     PERFORM  PASS.                                               K7SEA4.2
151600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
151700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
151800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
151900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
152000 COPY-TEST-191.                                                   K7SEA4.2
152100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
152200     MOVE     "COPY-TEST-191" TO PAR-NAME.                        K7SEA4.2
152300     PERFORM  PASS.                                               K7SEA4.2
152400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
152500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
152600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
152700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
152800 COPY-TEST-192.                                                   K7SEA4.2
152900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
153000     MOVE     "COPY-TEST-192" TO PAR-NAME.                        K7SEA4.2
153100     PERFORM  PASS.                                               K7SEA4.2
153200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
153300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
153400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
153500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
153600 COPY-TEST-193.                                                   K7SEA4.2
153700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
153800     MOVE     "COPY-TEST-193" TO PAR-NAME.                        K7SEA4.2
153900     PERFORM  PASS.                                               K7SEA4.2
154000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
154100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
154200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
154300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
154400 COPY-TEST-194.                                                   K7SEA4.2
154500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
154600     MOVE     "COPY-TEST-194" TO PAR-NAME.                        K7SEA4.2
154700     PERFORM  PASS.                                               K7SEA4.2
154800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
154900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
155000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
155100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
155200 COPY-TEST-195.                                                   K7SEA4.2
155300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
155400     MOVE     "COPY-TEST-195" TO PAR-NAME.                        K7SEA4.2
155500     PERFORM  PASS.                                               K7SEA4.2
155600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
155700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
155800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
155900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
156000 COPY-TEST-196.                                                   K7SEA4.2
156100     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
156200     MOVE     "COPY-TEST-196" TO PAR-NAME.                        K7SEA4.2
156300     PERFORM  PASS.                                               K7SEA4.2
156400     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
156500     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
156600     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
156700     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
156800 COPY-TEST-197.                                                   K7SEA4.2
156900     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
157000     MOVE     "COPY-TEST-197" TO PAR-NAME.                        K7SEA4.2
157100     PERFORM  PASS.                                               K7SEA4.2
157200     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
157300     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
157400     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
157500     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
157600 COPY-TEST-198.                                                   K7SEA4.2
157700     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
157800     MOVE     "COPY-TEST-198" TO PAR-NAME.                        K7SEA4.2
157900     PERFORM  PASS.                                               K7SEA4.2
158000     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
158100     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
158200     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
158300     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
158400 COPY-TEST-199.                                                   K7SEA4.2
158500     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
158600     MOVE     "COPY-TEST-199" TO PAR-NAME.                        K7SEA4.2
158700     PERFORM  PASS.                                               K7SEA4.2
158800     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
158900     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
159000     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
159100     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
159200 COPY-TEST-200.                                                   K7SEA4.2
159300     MOVE     "1600-CARD LIBRARY" TO FEATURE.                     K7SEA4.2
159400     MOVE     "COPY-TEST-200" TO PAR-NAME.                        K7SEA4.2
159500     PERFORM  PASS.                                               K7SEA4.2
159600     MOVE     SPACE TO COMPUTED-A.                                K7SEA4.2
159700     MOVE     SPACE TO CORRECT-A.                                 K7SEA4.2
159800     MOVE     SPACE TO RE-MARK.                                   K7SEA4.2
159900     PERFORM  PRINT-DETAIL.                                       K7SEA4.2
      *END-OF,K7SEA                                                                   
