      *HEADER,CLBRY,KK208A                                                            
000100     MOVE "FAIL" TO P-OR-F.                                       KK2084.2
      *END-OF,KK208A                                                                  
