      *HEADER,CLBRY,KP003                                                             
000100 PST-TEST-003.                                                    KP0034.2
000200     MOVE    +0009 TO WRK-DS-05V00-O005-001  IN GRP-003 (3).      KP0034.2
000300     ADD     +00001 TO WRK-DS-09V00-901.                          KP0034.2
000400     SUBTRACT 1 FROM WRK-DS-05V00-O005-001 IN GRP-002 (3).        KP0034.2
000500 PST-EXIT-003-X.                                                  KP0034.2
      *END-OF,KP003                                                                   
