      *HEADER,CLBRY,KP005                                                             
000100     MOVE 1 TO WRK-DS-09V00-901.                                  KP0054.2
      *END-OF,KP005                                                                   
