      *HEADER,CLBRY,KP007                                                             
000100     PERFORM FAIL.                                                KP0074.2
000200*    THIS COMMENT SHOULD NOT AFFECT PSEUDO-TEXT MATCHING.         KP0074.2
000300     SUBTRACT 1 FROM ERROR-COUNTER.                               KP0074.2
      *END-OF,KP007                                                                   
